// ---------------------------------------------Task 1-------------------------------------------------------------
// --створити масив та вивести його в консоль:
//  - з 5 числових значень
//  - з 5 стічкових значень
//  - з 5 значень стрічкового, числового та булевого типу

// let arrNumber = [5, 22, -88, 7, 33];
// console.log(arrNumber);
//
// let arrString = ["Ivan", "Taras", "OWU10", "Main", "JS"];
// console.log(arrString);
//
// let arrMix = [1, true, "Day", false, -88];
// console.log(arrMix);

// ---------------------------------------------Task 2-------------------------------------------------------------
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// arr[0] = 22;
// arr[1] = "Ivan";
// arr[2] = true;
// arr[3] = -88;
// arr[4] = false;
//
// console.log(arr);

// ---------------------------------------------Task 3-------------------------------------------------------------
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++) {
//     document.write("<div>Hello World</div>");
// }

// ---------------------------------------------Task 4-------------------------------------------------------------
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Hello ${i} OWU</div>`);
// }

// ---------------------------------------------Task 5-------------------------------------------------------------
// За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let count = 0;
// while (count < 20) {
//     document.write("<h1>This is JS</h1>")
//     count++;
// }

// ---------------------------------------------Task 6-------------------------------------------------------------
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let count = 0;
// while (count < 20) {
//     document.write(`<h1>This is ${count} JS</h1>`)
//     count++;
// }

// ---------------------------------------------Task 7-------------------------------------------------------------
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = [3, 8, -99, 7, 654, -221, 87, 36, 99, 7];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// ---------------------------------------------Task 8-------------------------------------------------------------
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = ["owu", "Ivan", "OWU10", "JS", "JAVA", "React", "Idea", "Poker", "PS", "WCOOP"];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// ---------------------------------------------Task 9-------------------------------------------------------------
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let arr = [22, "Arr", -88, true, "YYY", false, "XXX", 99];
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// ---------------------------------------------Task 10-------------------------------------------------------------
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let arr = [true, 22, -99, 55, "Taras", false, "Nazar", true, 66, false, "JS", true];
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "boolean") {
//         console.log(arr[i]);
//     }
// }

// ---------------------------------------------Task 11-------------------------------------------------------------
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// let arr = [true, 22, -99, 55, "Taras", false, -654, "Nazar", true, 66, "JS", false, "JS", true, "Java", 8887];
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "number") {
//         console.log(arr[i]);
//     }
// }

// ---------------------------------------------Task 12-------------------------------------------------------------
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let arr = [true, 22, -99, 55, "Taras", false, -654, "Nazar", true, 66, "JS", false, "React", true, "Java", 8887];
// for (let i = 0; i < arr.length; i++) {
//     if (typeof arr[i] === "string") {
//         console.log(arr[i]);
//     }
// }

// ---------------------------------------------Task 13-------------------------------------------------------------
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let arr = [];
// arr[0] = 2;
// arr[1] = "Today";
// arr[2] = true;
// arr[3] = "Taras";
// arr[4] = 88;
// arr[5] = -354;
// arr[6] = false;
// arr[7] = "JS";
// arr[8] = 123;
// arr[9] = "Finish";
//
// for (let i = 0; i < arr.length; i++) {
//     console.log(arr[i]);
// }

// ---------------------------------------------Task 14-------------------------------------------------------------
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 10; i++) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// ---------------------------------------------Task 15-------------------------------------------------------------
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i++) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// ---------------------------------------------Task 16-------------------------------------------------------------
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

// for (let i = 0; i < 100; i += 2) {
//     console.log(i);
//     document.write(i + "<br>");
// }

// ---------------------------------------------Task 17-------------------------------------------------------------
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//     if (i % 2 === 0) {
//         console.log(i);
//         document.write(i + "<br>");
//     }
// }

// ---------------------------------------------Task 18-------------------------------------------------------------
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 0; i < 100; i++) {
//     if (i % 2 !== 0) {
//         console.log(i);
//         document.write(i + "<br>");
//     }
// }

// ---------------------------------------------Task 19-------------------------------------------------------------
// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)

// for (let i = 0; i < 2; i++) {
//     for (let j = 0; j < 60; j++) {
//         document.write(i + " хв " + j + " секунд" + "<br>");
//     }
//
// }

// ---------------------------------------------Task 20-------------------------------------------------------------
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

// for (let i = 0; i <= 2; i++) {
//     for (let j = 0; j < 20; j++) {
//         for (let k = 0; k < 60; k++) {
//             document.write(i + "годин " + j + " хвилин " + k + " секунда" + "<br>")
//         }
//     }
// }


// ---------------------------------------------Task 21(додаткова)-----------------------------------------------------
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

// let arr = ['a', 'b', 'c'];
// let string = "";
// for (let i = 0; i < arr.length; i++) {
//     string += arr[i];
// }
// document.write(string);


// ---------------------------------------------Task 22(додаткова)-----------------------------------------------------
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

// let arr = ['a', 'b', 'c'];
// let count = 0;
// let string = "";
//
// while (count < arr.length) {
//     string += arr[count];
//     count++;
// }
// document.write(string);
